loadtest/chat-ws.yml
# Load test — chat WebSocket (/v1/openp2p/chat), auth included.
#
# Same disclosed gap as intent-api.yml (TECHNICAL_WHITEPAPER.md section
# 12): no throughput numbers exist yet for the WS side either.
#
# Prerequisite: node loadtest/pregenerate-users.js — Artillery's ws
# engine only honors `connect` as the literal first flow step
# (@artilleryio/int-core's engine_ws.js reads scenarioSpec[0] directly),
# so per-VU auth can't run as an earlier step the way it does for the
# http engine in intent-api.yml. Each VU instead picks a real,
# pre-authenticated session from that pool (processor.js's
# pickChatSession) and sends a PING — the cheapest real round trip
# through the actual WS route (chat.routes.ts), not a synthetic echo
# server.
#
# Run: node loadtest/pregenerate-users.js && npx artillery run chat-ws.yml
config:
  target: "ws://localhost:3000"
  processor: "./processor.js"
  phases:
    - duration: 20
      arrivalRate: 5
      name: Warm-up
    - duration: 30
      arrivalRate: 15
      name: Sustained load

scenarios:
  - name: "Connect and PING/PONG (pre-authenticated)"
    engine: "ws"
    flow:
      - connect:
          function: "pickChatSession"
      - send: '{"type":"PING","payload":{}}'
      - think: 1